DataFrane_Pandas

## Boolean

In [1]:
print(True == False)
print(True == True)

False
True

In [2]:
True == True

True

In [3]:
True != True

False

In [4]:
True !='!'

True

In [5]:
True == '!'

False

In [6]:
e='Abcde'

In [8]:
e.upper()

'abcde'

In [9]:
e.lower()

'abcde'

In [10]:
big=e.upper()
big

'ABCDE'

In [25]:
data = ['염라', '너로피어오라',2,3,4]
t=(1,2,3,4,5)
d={'name':'일' , 2:'이'}

In [27]:
d.keys()

dict_keys(['name', 2])

In [30]:
d.values()

dict_values(['일', '이'])

In [26]:
d['name']

'일'

In [ ]:
t[0]='일' #튜플의 요소는 기본적으로 바꿀 수 없다

In [18]:
data[1]

'너로피어오라'

In [20]:
data[2:]

[2, 3, 4]

In [21]:
data[0] = '달의하루'
data[0]

'달의하루'

In [12]:
type(data)

list

In [13]:
type(d)

dict

In [14]:
type(t)

tuple

In [31]:
a=[1,2,3]
b=['치킨', '피자', '고구마']

In [33]:
a

[1, 2, 3]

In [37]:
b

['치킨', '피자', '고구마']

In [39]:
s1=[a,b]

In [40]:
s1

[[1, 2, 3], ['치킨', '피자', '고구마']]

In [36]:
import pandas as pd

In [42]:
pd.Series(s1)

0        [1, 2, 3]
1    [치킨, 피자, 고구마]
dtype: object

In [43]:
pd.DataFrame(s1)

    0   1    2
0   1   2    3
1  치킨  피자  고구마

In [45]:
a.append(400)
a

[1, 2, 3, '400', 400]

In [46]:
print(True == False)
print(True != 0)
print(False -- 0)
print(True or False)
print(1 == '1')

False
True
0
True
False

In [48]:
eng = 'Korea COVID 19'
eng.lower()

'korea covid 19'

In [49]:
eng.upper()

'KOREA COVID 19'

In [63]:
data = []
data.append('java')
data[0], data[-1], data[1:], data[:2]
data.reverse()
data

['java']

In [64]:
b=(1,2,3, '사', '오')
c=1,2,3
type(b), type(c)
b[3] = 4
b[3:], b[1:4]

TypeError: 'tuple' object does not support item assignment

In [68]:
dic = {'name1' :'경민', '학번1':20103, 'name2' :'경민2', '학번2':20104}
dic.values()

dict_values(['경민', 20103, '경민2', 20104])

In [69]:
lunch = {'햄버거', '치킨', '라면', '콜라', 10000}
dinner = {'피자', '족발', '라면', '콜라', 10000}
print(lunch & dinner)
print(dinner | lunch)

{10000, '라면', '콜라'}
{'콜라', '족발', 10000, '라면', '햄버거', '치킨', '피자'}

In [70]:
s1 = pd.core.series.Series([1,2,3])
s2 = pd.core.series.Series(['일', '이', '삼'])
pd.DataFrame(data=dict(num=s1, word=s2))

   num word
0    1    일
1    2    이
2    3    삼

In [77]:
num_se = pd.Series([1,2,3,4,5])
num_df = pd.DataFrame([1,2,3,4,5], index=[1,2,3,4,5])
num_se

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [78]:
num_df

   0
1  1
2  2
3  3
4  4
5  5

In [74]:
pd.DataFrame(d,index=[1,2,3,4,5],columns=['이름'])

    이름
1  NaN
2  NaN
3  NaN
4  NaN
5  NaN

In [73]:
pd.DataFrame(['일','이','삼','사','오'],index=[1,2,3,4,5], columns=['이름'])

  이름
1  일
2  이
3  삼
4  사
5  오

In [84]:
per = [
    {'이름':'은주', '나이':30, '직업':'J1'},
    {'이름':'소주', '나이':20, '직업':'J2'},
    {'이름':'대주', '나이':10, '직업':'J3'},
    {'이름':'구주', '나이':40, '직업':'J4'},
]

In [85]:
pd.DataFrame(per)

   이름  나이  직업
0  은주  30  J1
1  소주  20  J2
2  대주  10  J3
3  구주  40  J4

In [90]:
per_2 = {'이름':['은주','소주','은주','은주'],
         '나이':[30,40,10,21],
         '직업':['j1','j1','j1','j1']
 }

In [91]:
pd.DataFrame(per_2, index=[4,5,6,7])

   이름  나이  직업
4  은주  30  j1
5  소주  40  j1
6  은주  10  j1
7  은주  21  j1

In [88]:
man = [
    {'name':'은주', 'age':20, 'job':'j1'},
    {'name':'민서', 'age':30, 'job':'j2'},
    {'name':'경민', 'age':15, 'job':'j3'},
]
df=pd.DataFrame(man, index=[1,2,3])
df

  name  age job
1   은주   20  j1
2   민서   30  j2
3   경민   15  j3

In [89]:
person = [
    ['a',100,80],['b',17,60],['b',50,40],['d',90,80]
]
col_name=['name', '국어','영어']
df=pd.DataFrame.from_records(person, columns=col_name, index=[1,2,3,4])
df[['국어','영어']]>70

      국어     영어
1   True   True
2  False  False
3  False  False
4   True   True

In [97]:
wryyy = {
    '사람':['야근로세','군브라본','뽈쟁이'],
    '분류':['약쟁이','구닌','웹툰작가']
}
pd.DataFrame(wryyy, index=[1,2,3])

     사람    분류
1  야근로세   약쟁이
2  군브라본    구닌
3   뽈쟁이  웹툰작가